/**
 * 这里是维护一些校验中的 正则表达式 和 对应的提醒文案
 * 统一使用这里的方法，不要在各自模块里编写
 */

// 手机号码
export const phone_reg = /^(?:(?:\+|00)86)?1[3-9]\d{9}$/;
export const phone_waring_text = "请输入正确的手机号码";

// 身份证号
export const id_number_reg =
  /^\d{6}((((((19|20)\d{2})(0[13-9]|1[012])(0[1-9]|[12]\d|30))|(((19|20)\d{2})(0[13578]|1[02])31)|((19|20)\d{2})02(0[1-9]|1\d|2[0-8])|((((19|20)([13579][26]|[2468][048]|0[48]))|(2000))0229))\d{3})|((((\d{2})(0[13-9]|1[012])(0[1-9]|[12]\d|30))|((\d{2})(0[13578]|1[02])31)|((\d{2})02(0[1-9]|1\d|2[0-8]))|(([13579][26]|[2468][048]|0[048])0229))\d{2}))(\d|X|x)$/;
export const id_number_warning_text = "请输入正确的身份证号";
